tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "sqlite"
brew "autojump"
brew "automake"
brew "node"
brew "bash-language-server"
brew "bat"
brew "bear"
brew "boost"
brew "pkg-config"
brew "cmake"
brew "ctags", link: false
brew "delve"
brew "dust"
brew "exa"
brew "fd"
brew "fzf"
brew "git"
brew "git-delta"
brew "glew"
brew "glib-openssl"
brew "global"
brew "gnupg"
brew "go"
brew "gopls"
brew "harfbuzz"
brew "htop"
brew "jq"
brew "lazygit"
brew "llvm"
brew "lua-language-server"
brew "maven"
brew "mycli"
brew "mysql"
brew "ncdu"
brew "neovim"
brew "nginx"
brew "openjdk@17"
brew "openssl@3", link: true
brew "tree"
brew "pass"
brew "pinentry-mac"
brew "qt"
brew "poppler"
brew "pyright"
brew "redis"
brew "ripgrep"
brew "scala"
brew "sdl2"
brew "sdl2_image"
brew "showkey"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "wget"
brew "yarn"
brew "d12frosted/emacs-plus/emacs-plus@28"
cask "alacritty"
cask "amethyst"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "zulu11"
cask "zulu8"
