tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.aliyun.com/homebrew/homebrew-cask.git"
tap "homebrew/cask-fonts", "https://mirrors.aliyun.com/homebrew/homebrew-cask-fonts.git"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "theseal/ssh-askpass"
brew "sqlite"
brew "autojump"
brew "automake"
brew "openssl@3"
brew "node"
brew "bash-language-server"
brew "bat"
brew "bear"
brew "boost"
brew "pkg-config"
brew "python@3.9"
brew "cmake"
brew "ctags", link: false
brew "delve"
brew "doxygen"
brew "dust"
brew "exa"
brew "fd"
brew "fossil"
brew "fzf"
brew "git"
brew "git-delta"
brew "glew"
brew "glib-openssl"
brew "python@3.11"
brew "global"
brew "gnupg"
brew "go"
brew "gopls"
brew "harfbuzz"
brew "htop"
brew "jq"
brew "lazygit"
brew "llvm"
brew "lua-language-server"
brew "luarocks"
brew "maven"
brew "mongosh"
brew "mycli", link: false
brew "mysql"
brew "ncdu"
brew "neovim"
brew "nginx"
brew "opencc"
brew "openjdk@17"
brew "tree"
brew "pass"
brew "pinentry-mac"
brew "plantuml"
brew "poppler"
brew "pyenv"
brew "pyright"
brew "qt"
brew "ranger"
brew "redis"
brew "ripgrep"
brew "scala"
brew "sdl2"
brew "sdl2_image"
brew "showkey"
brew "telnet"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "wget"
brew "yarn"
brew "theseal/ssh-askpass/ssh-askpass"
cask "amethyst"
cask "emacs"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "postman"
cask "visual-studio-code"
cask "zulu8"
vscode "asvetliakov.vscode-neovim"
vscode "cschlosser.doxdocgen"
vscode "formulahendry.code-runner"
vscode "golang.go"
vscode "iocave.monkey-patch"
vscode "jeff-hykin.better-cpp-syntax"
vscode "mads-hartmann.bash-ide-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "withfig.fig"
vscode "WLY.translationtoolbox"
